fonecmid-diplom/src/Documents/ВКМ_ВыплатыЗарплаты/ВКМ_ВыплатыЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ВыплатыЗарплаты</name>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <tabularSections>
    <name>Выплаты</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.ВКМ_Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ВКМ_Подразделения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_ВыплатыЗарплаты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда   
	
	#Область ОбработчикиСобытийМодуляОбъекта
	
Процедура ОбработкаПроведения(Отказ, Режим)

	//ВКМ 21.01.2026, Проверка: табличная часть не пустая
	Если Выплаты.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Не заполнено ни одной строчки");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	//ВКМ 21.01.2026, Проверка: суммы > 0 + копим суммы по (Сотрудник, Подразделение)
	СуммыПоКлючу = Новый Соответствие; // ключ(строка) -> сумма
	Ключи = Новый Массив;

	Для Каждого Стр Из Выплаты Цикл

		Если Стр.Сумма <= 0 Тогда
			ОбщегоНазначения.СообщитьПользователю(
				"Сумма выплаты должна быть больше 0! " +
				"Сотрудник: " + Стр.Сотрудник +
				", Подразделение: " + Стр.Подразделение
			);
			Отказ = Истина;
			Возврат;
		КонецЕсли;

		// Ключ строкой (так надёжнее, чем Структура как ключ в старых режимах)
		КлючСтрокой = Строка(Стр.Сотрудник) + "|" + Строка(Стр.Подразделение);

		ТекСумма = СуммыПоКлючу[КлючСтрокой]; // если нет ключа -> Неопределено

		Если ТекСумма = Неопределено Тогда
			СуммыПоКлючу.Вставить(КлючСтрокой, Стр.Сумма);
			Ключи.Добавить(КлючСтрокой);
		Иначе
			СуммыПоКлючу[КлючСтрокой] = ТекСумма + Стр.Сумма;
		КонецЕсли;

	КонецЦикла;

	//ВКМ 21.01.2026, Проверка остатков по регистру для каждой пары
	ЗапросОстатков = Новый Запрос;
	ЗапросОстатков.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Ост.СуммаОстаток, 0) КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(
	|		&Дата,
	|		Сотрудник = &Сотрудник
	|		И Подразделение = &Подразделение
	|	) КАК Ост";

	Для Каждого КлючСтрокой Из Ключи Цикл

		// Разбираем ключ обратно
		ПозицияРазделителя = Найти(КлючСтрокой, "|");
		СотрСтрокой = Лев(КлючСтрокой, ПозицияРазделителя - 1);
		ПодрСтрокой = Сред(КлючСтрокой, ПозицияРазделителя + 1);
		СотрудникЗнач = Неопределено;
		ПодразделениеЗнач = Неопределено;

		Для Каждого Стр Из Выплаты Цикл
			Если Строка(Стр.Сотрудник) = СотрСтрокой И Строка(Стр.Подразделение) = ПодрСтрокой Тогда
				СотрудникЗнач = Стр.Сотрудник;
				ПодразделениеЗнач = Стр.Подразделение;
				Прервать;
			КонецЕсли;
		КонецЦикла;

		СуммаВыплаты = СуммыПоКлючу[КлючСтрокой];

		ЗапросОстатков.УстановитьПараметр("Дата", Дата);
		ЗапросОстатков.УстановитьПараметр("Сотрудник", СотрудникЗнач);
		ЗапросОстатков.УстановитьПараметр("Подразделение", ПодразделениеЗнач);

		Рез = ЗапросОстатков.Выполнить();
		Выб = Рез.Выбрать();

		Остаток = 0;
		Если Выб.Следующий() Тогда
			Остаток = Выб.СуммаОстаток;
		КонецЕсли;

		Если СуммаВыплаты > Остаток Тогда
			ОбщегоНазначения.СообщитьПользователю(
				"Недостаточно остатка для выплаты! " +
				"Сотрудник: " + СотрудникЗнач +
				", Подразделение: " + ПодразделениеЗнач +
				". Остаток: " + Формат(Остаток, "ЧГ=15.2") +
				", Выплата: " + Формат(СуммаВыплаты, "ЧГ=15.2")
			);
			Отказ = Истина;
			Возврат;
		КонецЕсли;

	КонецЦикла;

	//ВКМ 21.01.2026, Движения по регистру (Расход)
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;

	Для Каждого Стр Из Выплаты Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Сотрудник = Стр.Сотрудник;
		Движение.Подразделение = Стр.Подразделение;
		Движение.Сумма = Стр.Сумма;
	КонецЦикла;

КонецПроцедуры

	#КонецОбласти
	
	#Область СлужебныеПроцедурыФункции
	
	Процедура ЗаполнитьЗП() Экспорт
		
		Выплаты.Очистить();
		 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Подразделение КАК Подразделение,
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Дата, ) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки
		|ГДЕ
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток > 0"; // Фильтр положительных остатков
		
		Запрос.УстановитьПараметр("Дата", Дата); 
		
		РезультатЗапроса = Запрос.Выполнить();    
		
		Если РезультатЗапроса.Пустой() Тогда
			
			ОбщегоНазначения.СообщитьПользователю("Остатков по выплатам нет!"); 
			Возврат; 
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать(); 
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.СуммаОстаток > 0 Тогда
				Строка = Выплаты.Добавить();        
				Строка.Сотрудник = Выборка.Сотрудник; 
				Строка.Подразделение = Выборка.Подразделение; 
				Строка.Сумма = Выборка.СуммаОстаток; 
			КонецЕсли;
			
		КонецЦикла;
		
	КонецПроцедуры   
	
	#КонецОбласти
	
#КонецЕсли
